// // Мінімум

// // Створи об'єкт, що описує автомобіль (виробник, модель, рік випуску, середня швидкість, обсяг паливного баку, середня витрата палива на 100 км., водії), і наступні методи для роботи з цим об'єктом:
// // Метод, який виводить на екран інформацію про автомобіль.
// // Додавання ім’я водія у список
// // Перевірка водія на наявність його ім’я у списку
// // Підрахунок необхідного часу та кількості палива для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину. 

// const car = {
//     maker: "Mitsubishi",
//     model: "Lancer",
//     year: 2006,
//     averageSpeed: 90,
//     tankCapacity: 40,
//     averageConsumption: 12,
    
//     carInfo() {
//      for(let key in this){
//        if(typeof(this[key]) !== 'function'){
//             console.log(`${key} = ${this[key]}`)
//          } 
//        }
//     },
  
//     checkName(driver) {
//       if(this.driver == driver){
//         return true
//       }else{
//         return false
//       }
//   },

// }


// // 1)Метод, який виводить на екран інформацію про автомобіль.

// // car.carInfo();

// // 2)Додавання ім’я водія у список

// car.driver = "Ivan";
// car.carInfo();

// // 3) Перевірка водія на наявність його ім’я у списку

// console.log(car.checkName('Ivan'));
// console.log(car.checkName('Anton'));


// // 4)Підрахунок необхідного часу та кількості палива для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину. 


// // Норма

// // Створити об'єкт, що описує час (години, хвилини, секунди), і такі функції для роботи з цим об'єктом:
// // Для виведення часу на екран.
// // Зміни часу на передану кількість секунд.
// // Зміни часу на передану кількість хвилин.
// // Зміни часу на передану кількість годин.
// // Враховуйте, що в останніх 3-х функціях, при зміні однієї частини часу, може змінитися і інша. Наприклад: якщо до часу «20:59:45» додати 30 секунд, то повинно вийти «21:00:15», а не «20:59:75». Також потрібно передбачити можливість того що користувач може передати 150 секунд, або 75 хвилин.
// // Максимум

// // Створи об'єкт, що описує звичайний дріб. Створи об'єкт, який має методи роботи з дробом:
// // Складання 2-х об'єктів-дробів.
// // Віднімання 2-х об'єктів-дробів.
// // Множення 2-х об'єктів-дробів.
// // Ділення 2-х об'єктів-дробів.
// // Скорочення об'єкта-дробу.
// // (Тобі потрібно буде створити ще деякі методи не зазначені в завданні, для отримання математично правильної відповіді)

// let education = 'Ph.D.'

// let obj = {
//     name: 'Jane',
//     age: 25,
//     'eye color': 'brown',
//     education
// }

//1) console.log(obj)
// console.log(obj.name);
// console.log(obj['education']);


//2) for( let key in obj) {
//     console.log(`${key} = ${obj[key]}`);
// }

//3) for(const [key, value] of Object.entries(obj)){
//     console.log(`in Object ${key}: ${value}`);
// }

// 4)
// const user2 = obj;

// user2.age = 30;

// console.log(obj.age)

// 5)Object copy
// let user3 = {};
// for(let key in obj){
//     user3[key] = obj[key];
// }

// console.log(user3)


